import pandas as pd

data = {'이름' : ['KIM', 'PARK', 'LEE', 'HO'],
        '국어' : [90, 58, 88, 100],
        '영어': [100, 60, 80, 70],
        '수학': [55, 65, 76, 88]}

# 데이터 프레임을 출력하시오.
print("1----------------------------------------")
df = pd.DataFrame(data)
print(df, end= "\n\n")

# 학생이름만 추출해서 출력하시오.
print("2----------------------------------------")
print(df.iloc[:,0],end="\n\n")


# 'PARK' 성적만 출력하시오.
print("3----------------------------------------")
print(df.loc[1],end= '\n\n')

# 'HO' 학생의 수학점수를 90점으로 수정하시오.
print("4----------------------------------------")
df.loc[df['이름'] == 'HO', '수학'] = 90
print(df, end= '\n\n')

# 'oh' 학생의 국어(100), 영어(90), 수학(80) 성적을 새로 추가하시오.
print("5----------------------------------------")
df.loc[4] = ['oh', 100, 70, 80]
print(df,end= '\n\n')


# 'LEE' 학생의 성적을 삭제하시오.
print("6----------------------------------------")
print(df.drop ([2] ,axis = 0))